In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
url = "https://raw.githubusercontent.com/tranghth-lux/data-science-complete-tutorial/master/Data/HR_comma_sep.csv.txt"

In [3]:
employee_data = pd.read_csv(url)

In [4]:
employee_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [5]:
employee_data.shape

(14999, 10)

In [6]:
employee_data.isnull().sum()

satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
time_spend_company       0
Work_accident            0
left                     0
promotion_last_5years    0
sales                    0
salary                   0
dtype: int64

In [7]:
employee_data.drop(['sales'],axis=1,inplace=True)

In [8]:
employee_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,salary
0,0.38,0.53,2,157,3,0,1,0,low
1,0.80,0.86,5,262,6,0,1,0,medium
2,0.11,0.88,7,272,4,0,1,0,medium
3,0.72,0.87,5,223,5,0,1,0,low
4,0.37,0.52,2,159,3,0,1,0,low

In [9]:
employee_data.shape

(14999, 9)

In [10]:
employee_data['salary'].unique()

array(['low', 'medium', 'high'], dtype=object)

In [11]:
salary = pd.get_dummies(employee_data['salary'],drop_first=False)

In [12]:
salary

       high  low  medium
0         0    1       0
1         0    0       1
2         0    0       1
3         0    1       0
4         0    1       0
...     ...  ...     ...
14994     0    1       0
14995     0    1       0
14996     0    1       0
14997     0    1       0
14998     0    1       0

[14999 rows x 3 columns]

In [13]:
employee_data = pd.concat([employee_data,salary],axis=1)

In [14]:
employee_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,salary,high,low,medium
0,0.38,0.53,2,157,3,0,1,0,low,0,1,0
1,0.80,0.86,5,262,6,0,1,0,medium,0,0,1
2,0.11,0.88,7,272,4,0,1,0,medium,0,0,1
3,0.72,0.87,5,223,5,0,1,0,low,0,1,0
4,0.37,0.52,2,159,3,0,1,0,low,0,1,0

In [16]:
employee_data.drop(['salary'],axis=1,inplace=True)

In [17]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [18]:
x = employee_data.drop(['left'],axis=1)

In [19]:
y = employee_data['left']

In [20]:
x_train, x_test, y_train,y_test = train_test_split(x,y, test_size=0.3,random_state=10)

In [21]:
model = LogisticRegression()

In [22]:
model.fit(x_train,y_train)

C:\Users\mdfai\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [23]:
y_pred = model.predict(x_test)

In [24]:
from sklearn.metrics import accuracy_score

In [25]:
accuracy_score(y_pred,y_test)

0.7886666666666666